###############################################################################
# Created by write_sdc
###############################################################################
current_design analog_ctrl_regs_APB
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name PCLK -period 17.0000 [get_ports {PCLK}]
set_clock_uncertainty 0.1000 PCLK
set_propagated_clock [get_clocks {PCLK}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[0]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[0]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[10]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[10]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[11]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[11]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[12]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[12]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[13]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[13]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[14]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[14]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[15]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[15]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[16]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[16]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[17]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[17]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[18]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[18]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[19]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[19]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[1]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[1]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[20]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[20]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[21]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[21]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[22]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[22]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[23]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[23]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[24]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[24]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[25]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[25]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[26]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[26]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[27]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[27]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[28]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[28]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[29]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[29]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[2]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[2]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[30]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[30]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[31]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[31]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[3]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[3]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[4]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[4]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[5]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[5]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[6]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[6]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[7]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[7]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[8]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[8]}]
set_input_delay 3.2000 -clock [get_clocks {PCLK}] -min -add_delay [get_ports {PADDR[9]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -max -add_delay [get_ports {PADDR[9]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PENABLE}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRESETn}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PSEL}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[0]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[10]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[11]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[12]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[13]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[14]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[15]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[16]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[17]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[18]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[19]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[1]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[20]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[21]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[22]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[23]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[24]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[25]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[26]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[27]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[28]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[29]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[2]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[30]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[31]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[3]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[4]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[5]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[6]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[7]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[8]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWDATA[9]}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PWRITE}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_filt}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_timeout}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_unfilt}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_vunder}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_out}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {overvoltage_out}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_out}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vccd1_pwr_good}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vccd2_pwr_good}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vdda1_pwr_good}]
set_input_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vdda2_pwr_good}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {IRQ}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[0]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[10]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[11]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[12]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[13]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[14]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[15]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[16]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[17]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[18]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[19]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[1]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[20]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[21]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[22]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[23]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[24]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[25]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[26]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[27]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[28]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[29]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[2]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[30]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[31]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[3]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[4]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[5]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[6]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[7]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[8]}]
set_output_delay 4.5000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PRDATA[9]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {PREADY}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_gpio1_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_gpio1_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_gpio6_4[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_gpio6_4[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_vbgtc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc0_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_gpio1_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_gpio1_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_gpio6_5[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_gpio6_5[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_vbgsc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc1_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc_refh_to_gpio6_6[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc_refh_to_gpio6_6[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc_refl_to_gpio6_7[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {adc_refl_to_gpio6_7[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {analog0_connect[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {analog0_connect[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {analog1_connect[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {analog1_connect[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {audiodac_out_to_analog1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {audiodac_out_to_analog1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {audiodac_outb_to_analog0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {audiodac_outb_to_analog0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_sel}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[10]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[11]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[12]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[13]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[14]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[15]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[8]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {bandgap_trim[9]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_isrc_sel}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_oneshot}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_otrip[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_otrip[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_otrip[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_rc_dis}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_rc_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_vtrip[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_vtrip[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {brownout_vtrip[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_hyst[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_hyst[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_gpio1_4[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_gpio1_4[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_gpio6_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_gpio6_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_vbgsc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_gpio1_5[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_gpio1_5[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_gpio6_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_gpio6_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_vbgtc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_trim[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_trim[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_trim[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_trim[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_trim[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {comp_trim[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac0_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac0_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac1_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac1_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac_refh_to_gpio1_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac_refh_to_gpio1_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac_refl_to_gpio1_0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {dac_refl_to_gpio1_0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_ref_select}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_snk_ena[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_snk_ena[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_snk_ena[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_snk_ena[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[10]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[11]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[12]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[13]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[14]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[15]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[16]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[17]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[18]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[19]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[20]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[21]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[22]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[23]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[8]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_src_ena[9]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_test_to_gpio1_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ibias_test_to_gpio1_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_to_gpio1_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_to_gpio1_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_to_gpio1_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_to_gpio1_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[10]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[11]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[8]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {idac_value[9]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ldo_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ldo_ref_sel}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_amuxbusB}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_gpio2_0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_gpio2_0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_gpio5_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_gpio5_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_rheostat_tap}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_vbgtc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_amuxbusA}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_gpio2_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_gpio2_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_gpio5_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_gpio5_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_adc0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_adc0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_amuxbusB[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_amuxbusB[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_analog1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_analog1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_comp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_comp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio3_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio3_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio3_5[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio3_5[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio4_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio4_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio4_5[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_gpio4_5[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_ulpcomp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_hgbw_opamp_to_ulpcomp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G1[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G1[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G1[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G2[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G2[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_G2[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_amuxbusB}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_gpio5_7[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_gpio5_7[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_amuxbusA}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_gpio5_6[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_gpio5_6[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_adc0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_adc0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_amuxbusB[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_amuxbusB[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_analog1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_analog1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_comp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_comp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_gpio4_4[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_gpio4_4[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_ulpcomp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_instramp_to_ulpcomp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_amuxbusB}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_gpio5_5[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_gpio5_5[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_rheostat_tap}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_vbgsc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_amuxbusA}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_gpio5_4[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_gpio5_4[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_adc1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_adc1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_amuxbusA[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_amuxbusA[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_analog0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_analog0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_comp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_comp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_gpio3_4[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_gpio3_4[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_gpio4_0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_gpio4_0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_ulpcomp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_lp_opamp_to_ulpcomp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat1_b[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_rheostat2_b[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {left_vref_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {overvoltage_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {overvoltage_trim[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {overvoltage_trim[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {overvoltage_trim[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {overvoltage_trim[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[10]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[11]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[8]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac0_value[9]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[10]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[11]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[8]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {rdac1_value[9]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_amuxbusB}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_gpio2_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_gpio2_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_gpio5_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_gpio5_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_rheostat_tap}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_vbgsc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_amuxbusA}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_gpio2_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_gpio2_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_gpio5_0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_gpio5_0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_adc1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_adc1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_amuxbusA[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_amuxbusA[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_analog0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_analog0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_comp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_comp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio3_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio3_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio3_6[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio3_6[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio4_2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio4_2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio4_6[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_gpio4_6[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_ulpcomp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_hgbw_opamp_to_ulpcomp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G1[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G1[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G1[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G2[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G2[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G2[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G2[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_G2[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_amuxbusB}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_gpio2_6[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_gpio2_6[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_amuxbusA}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_gpio2_7[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_gpio2_7[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_adc1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_adc1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_amuxbusA[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_amuxbusA[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_analog0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_analog0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_comp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_comp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_gpio3_0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_gpio3_0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_ulpcomp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_instramp_to_ulpcomp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_amuxbusB}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_gpio2_4[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_gpio2_4[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_rheostat_tap}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_vbgtc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_amuxbusA}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_gpio2_5[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_gpio2_5[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_rheostat_out}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_adc0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_adc0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_amuxbusB[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_amuxbusB[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_analog1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_analog1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_comp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_comp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio3_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio3_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio3_7[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio3_7[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio4_3[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio4_3[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio4_7[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_gpio4_7[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_ulpcomp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_lp_opamp_to_ulpcomp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat1_b[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[2]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[3]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[4]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[5]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[6]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_rheostat2_b[7]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {right_vref_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {sio0_connect[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {sio0_connect[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {sio1_connect[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {sio1_connect[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {tempsense_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {tempsense_sel}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {tempsense_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_clk}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_ena}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_analog0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_dac1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_gpio1_6[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_gpio1_6[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_gpio6_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_gpio6_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_right_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_sio1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_vbgsc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_n_to_vinref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_analog1}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_dac0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_gpio1_7[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_gpio1_7[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_gpio6_0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_gpio6_0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_left_vref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_sio0}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_tempsense}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_vbgtc}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {ulpcomp_p_to_voutref}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_adc0[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_adc0[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_adc1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_adc1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_comp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_comp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_comp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_comp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_ulpcomp_n[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_ulpcomp_n[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_ulpcomp_p[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {user_to_ulpcomp_p[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vbg_test_to_gpio1_1[0]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vbg_test_to_gpio1_1[1]}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vbgsc_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vbgtc_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {vinref_to_user}]
set_output_delay 4.8000 -clock [get_clocks {PCLK}] -add_delay [get_ports {voutref_to_user}]
set_multicycle_path -hold\
    -through [list [get_ports {PADDR[0]}]\
           [get_ports {PADDR[10]}]\
           [get_ports {PADDR[11]}]\
           [get_ports {PADDR[12]}]\
           [get_ports {PADDR[13]}]\
           [get_ports {PADDR[14]}]\
           [get_ports {PADDR[15]}]\
           [get_ports {PADDR[16]}]\
           [get_ports {PADDR[17]}]\
           [get_ports {PADDR[18]}]\
           [get_ports {PADDR[19]}]\
           [get_ports {PADDR[1]}]\
           [get_ports {PADDR[20]}]\
           [get_ports {PADDR[21]}]\
           [get_ports {PADDR[22]}]\
           [get_ports {PADDR[23]}]\
           [get_ports {PADDR[24]}]\
           [get_ports {PADDR[25]}]\
           [get_ports {PADDR[26]}]\
           [get_ports {PADDR[27]}]\
           [get_ports {PADDR[28]}]\
           [get_ports {PADDR[29]}]\
           [get_ports {PADDR[2]}]\
           [get_ports {PADDR[30]}]\
           [get_ports {PADDR[31]}]\
           [get_ports {PADDR[3]}]\
           [get_ports {PADDR[4]}]\
           [get_ports {PADDR[5]}]\
           [get_ports {PADDR[6]}]\
           [get_ports {PADDR[7]}]\
           [get_ports {PADDR[8]}]\
           [get_ports {PADDR[9]}]]\
    -through [list [get_ports {PRDATA[0]}]\
           [get_ports {PRDATA[10]}]\
           [get_ports {PRDATA[11]}]\
           [get_ports {PRDATA[12]}]\
           [get_ports {PRDATA[13]}]\
           [get_ports {PRDATA[14]}]\
           [get_ports {PRDATA[15]}]\
           [get_ports {PRDATA[16]}]\
           [get_ports {PRDATA[17]}]\
           [get_ports {PRDATA[18]}]\
           [get_ports {PRDATA[19]}]\
           [get_ports {PRDATA[1]}]\
           [get_ports {PRDATA[20]}]\
           [get_ports {PRDATA[21]}]\
           [get_ports {PRDATA[22]}]\
           [get_ports {PRDATA[23]}]\
           [get_ports {PRDATA[24]}]\
           [get_ports {PRDATA[25]}]\
           [get_ports {PRDATA[26]}]\
           [get_ports {PRDATA[27]}]\
           [get_ports {PRDATA[28]}]\
           [get_ports {PRDATA[29]}]\
           [get_ports {PRDATA[2]}]\
           [get_ports {PRDATA[30]}]\
           [get_ports {PRDATA[31]}]\
           [get_ports {PRDATA[3]}]\
           [get_ports {PRDATA[4]}]\
           [get_ports {PRDATA[5]}]\
           [get_ports {PRDATA[6]}]\
           [get_ports {PRDATA[7]}]\
           [get_ports {PRDATA[8]}]\
           [get_ports {PRDATA[9]}]] 1
set_multicycle_path -setup\
    -through [list [get_ports {PADDR[0]}]\
           [get_ports {PADDR[10]}]\
           [get_ports {PADDR[11]}]\
           [get_ports {PADDR[12]}]\
           [get_ports {PADDR[13]}]\
           [get_ports {PADDR[14]}]\
           [get_ports {PADDR[15]}]\
           [get_ports {PADDR[16]}]\
           [get_ports {PADDR[17]}]\
           [get_ports {PADDR[18]}]\
           [get_ports {PADDR[19]}]\
           [get_ports {PADDR[1]}]\
           [get_ports {PADDR[20]}]\
           [get_ports {PADDR[21]}]\
           [get_ports {PADDR[22]}]\
           [get_ports {PADDR[23]}]\
           [get_ports {PADDR[24]}]\
           [get_ports {PADDR[25]}]\
           [get_ports {PADDR[26]}]\
           [get_ports {PADDR[27]}]\
           [get_ports {PADDR[28]}]\
           [get_ports {PADDR[29]}]\
           [get_ports {PADDR[2]}]\
           [get_ports {PADDR[30]}]\
           [get_ports {PADDR[31]}]\
           [get_ports {PADDR[3]}]\
           [get_ports {PADDR[4]}]\
           [get_ports {PADDR[5]}]\
           [get_ports {PADDR[6]}]\
           [get_ports {PADDR[7]}]\
           [get_ports {PADDR[8]}]\
           [get_ports {PADDR[9]}]]\
    -through [list [get_ports {PRDATA[0]}]\
           [get_ports {PRDATA[10]}]\
           [get_ports {PRDATA[11]}]\
           [get_ports {PRDATA[12]}]\
           [get_ports {PRDATA[13]}]\
           [get_ports {PRDATA[14]}]\
           [get_ports {PRDATA[15]}]\
           [get_ports {PRDATA[16]}]\
           [get_ports {PRDATA[17]}]\
           [get_ports {PRDATA[18]}]\
           [get_ports {PRDATA[19]}]\
           [get_ports {PRDATA[1]}]\
           [get_ports {PRDATA[20]}]\
           [get_ports {PRDATA[21]}]\
           [get_ports {PRDATA[22]}]\
           [get_ports {PRDATA[23]}]\
           [get_ports {PRDATA[24]}]\
           [get_ports {PRDATA[25]}]\
           [get_ports {PRDATA[26]}]\
           [get_ports {PRDATA[27]}]\
           [get_ports {PRDATA[28]}]\
           [get_ports {PRDATA[29]}]\
           [get_ports {PRDATA[2]}]\
           [get_ports {PRDATA[30]}]\
           [get_ports {PRDATA[31]}]\
           [get_ports {PRDATA[3]}]\
           [get_ports {PRDATA[4]}]\
           [get_ports {PRDATA[5]}]\
           [get_ports {PRDATA[6]}]\
           [get_ports {PRDATA[7]}]\
           [get_ports {PRDATA[8]}]\
           [get_ports {PRDATA[9]}]] 2
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0750 [get_ports {IRQ}]
set_load -pin_load 0.0750 [get_ports {PREADY}]
set_load -pin_load 0.0750 [get_ports {adc0_to_analog1}]
set_load -pin_load 0.0750 [get_ports {adc0_to_dac0}]
set_load -pin_load 0.0750 [get_ports {adc0_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {adc0_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {adc0_to_vbgtc}]
set_load -pin_load 0.0750 [get_ports {adc0_to_voutref}]
set_load -pin_load 0.0750 [get_ports {adc1_to_analog0}]
set_load -pin_load 0.0750 [get_ports {adc1_to_dac1}]
set_load -pin_load 0.0750 [get_ports {adc1_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {adc1_to_vbgsc}]
set_load -pin_load 0.0750 [get_ports {adc1_to_vinref}]
set_load -pin_load 0.0750 [get_ports {bandgap_ena}]
set_load -pin_load 0.0750 [get_ports {bandgap_sel}]
set_load -pin_load 0.0750 [get_ports {brownout_ena}]
set_load -pin_load 0.0750 [get_ports {brownout_isrc_sel}]
set_load -pin_load 0.0750 [get_ports {brownout_oneshot}]
set_load -pin_load 0.0750 [get_ports {brownout_rc_dis}]
set_load -pin_load 0.0750 [get_ports {brownout_rc_ena}]
set_load -pin_load 0.0750 [get_ports {comp_ena}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_analog0}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_dac1}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_vbgsc}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_analog1}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_dac0}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_vbgtc}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {dac0_to_analog1}]
set_load -pin_load 0.0750 [get_ports {dac0_to_user}]
set_load -pin_load 0.0750 [get_ports {dac1_to_analog0}]
set_load -pin_load 0.0750 [get_ports {dac1_to_user}]
set_load -pin_load 0.0750 [get_ports {ibias_ena}]
set_load -pin_load 0.0750 [get_ports {ibias_ref_select}]
set_load -pin_load 0.0750 [get_ports {idac_ena}]
set_load -pin_load 0.0750 [get_ports {ldo_ena}]
set_load -pin_load 0.0750 [get_ports {ldo_ref_sel}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_ena}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_amuxbusB}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_analog1}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_dac1}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_rheostat_tap}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_vbgtc}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_amuxbusA}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_analog0}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_dac0}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {left_instramp_ena}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_amuxbusB}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_analog1}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_amuxbusA}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_analog0}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_ena}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_amuxbusB}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_analog1}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_dac1}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_rheostat_tap}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_vbgsc}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_amuxbusA}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_analog0}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_dac0}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {left_vref_to_user}]
set_load -pin_load 0.0750 [get_ports {overvoltage_ena}]
set_load -pin_load 0.0750 [get_ports {rdac0_ena}]
set_load -pin_load 0.0750 [get_ports {rdac1_ena}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_ena}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_amuxbusB}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_analog1}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_dac1}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_rheostat_tap}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_vbgsc}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_amuxbusA}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_analog0}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_dac0}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {right_instramp_ena}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_amuxbusB}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_analog1}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_amuxbusA}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_analog0}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_ena}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_amuxbusB}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_analog1}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_dac1}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_rheostat_tap}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_vbgtc}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_amuxbusA}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_analog0}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_dac0}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_rheostat_out}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {right_vref_to_user}]
set_load -pin_load 0.0750 [get_ports {tempsense_ena}]
set_load -pin_load 0.0750 [get_ports {tempsense_sel}]
set_load -pin_load 0.0750 [get_ports {tempsense_to_user}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_clk}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_ena}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_analog0}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_dac1}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_right_vref}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_sio1}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_vbgsc}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_vinref}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_analog1}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_dac0}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_left_vref}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_sio0}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_tempsense}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_vbgtc}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_voutref}]
set_load -pin_load 0.0750 [get_ports {vbgsc_to_user}]
set_load -pin_load 0.0750 [get_ports {vbgtc_to_user}]
set_load -pin_load 0.0750 [get_ports {vinref_to_user}]
set_load -pin_load 0.0750 [get_ports {voutref_to_user}]
set_load -pin_load 0.0750 [get_ports {PRDATA[31]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[30]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[29]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[28]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[27]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[26]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[25]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[24]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[23]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[22]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[21]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[20]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[19]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[18]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[17]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[16]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[15]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[14]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[13]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[12]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[11]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[10]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[9]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[8]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[7]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[6]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[5]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[4]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[3]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[2]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[1]}]
set_load -pin_load 0.0750 [get_ports {PRDATA[0]}]
set_load -pin_load 0.0750 [get_ports {adc0_to_gpio1_3[1]}]
set_load -pin_load 0.0750 [get_ports {adc0_to_gpio1_3[0]}]
set_load -pin_load 0.0750 [get_ports {adc0_to_gpio6_4[1]}]
set_load -pin_load 0.0750 [get_ports {adc0_to_gpio6_4[0]}]
set_load -pin_load 0.0750 [get_ports {adc1_to_gpio1_2[1]}]
set_load -pin_load 0.0750 [get_ports {adc1_to_gpio1_2[0]}]
set_load -pin_load 0.0750 [get_ports {adc1_to_gpio6_5[1]}]
set_load -pin_load 0.0750 [get_ports {adc1_to_gpio6_5[0]}]
set_load -pin_load 0.0750 [get_ports {adc_refh_to_gpio6_6[1]}]
set_load -pin_load 0.0750 [get_ports {adc_refh_to_gpio6_6[0]}]
set_load -pin_load 0.0750 [get_ports {adc_refl_to_gpio6_7[1]}]
set_load -pin_load 0.0750 [get_ports {adc_refl_to_gpio6_7[0]}]
set_load -pin_load 0.0750 [get_ports {analog0_connect[1]}]
set_load -pin_load 0.0750 [get_ports {analog0_connect[0]}]
set_load -pin_load 0.0750 [get_ports {analog1_connect[1]}]
set_load -pin_load 0.0750 [get_ports {analog1_connect[0]}]
set_load -pin_load 0.0750 [get_ports {audiodac_out_to_analog1[1]}]
set_load -pin_load 0.0750 [get_ports {audiodac_out_to_analog1[0]}]
set_load -pin_load 0.0750 [get_ports {audiodac_outb_to_analog0[1]}]
set_load -pin_load 0.0750 [get_ports {audiodac_outb_to_analog0[0]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[15]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[14]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[13]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[12]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[11]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[10]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[9]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[8]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[7]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[6]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[5]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[4]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[3]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[2]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[1]}]
set_load -pin_load 0.0750 [get_ports {bandgap_trim[0]}]
set_load -pin_load 0.0750 [get_ports {brownout_otrip[2]}]
set_load -pin_load 0.0750 [get_ports {brownout_otrip[1]}]
set_load -pin_load 0.0750 [get_ports {brownout_otrip[0]}]
set_load -pin_load 0.0750 [get_ports {brownout_vtrip[2]}]
set_load -pin_load 0.0750 [get_ports {brownout_vtrip[1]}]
set_load -pin_load 0.0750 [get_ports {brownout_vtrip[0]}]
set_load -pin_load 0.0750 [get_ports {comp_hyst[1]}]
set_load -pin_load 0.0750 [get_ports {comp_hyst[0]}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_gpio1_4[1]}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_gpio1_4[0]}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_gpio6_3[1]}]
set_load -pin_load 0.0750 [get_ports {comp_n_to_gpio6_3[0]}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_gpio1_5[1]}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_gpio1_5[0]}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_gpio6_2[1]}]
set_load -pin_load 0.0750 [get_ports {comp_p_to_gpio6_2[0]}]
set_load -pin_load 0.0750 [get_ports {comp_trim[5]}]
set_load -pin_load 0.0750 [get_ports {comp_trim[4]}]
set_load -pin_load 0.0750 [get_ports {comp_trim[3]}]
set_load -pin_load 0.0750 [get_ports {comp_trim[2]}]
set_load -pin_load 0.0750 [get_ports {comp_trim[1]}]
set_load -pin_load 0.0750 [get_ports {comp_trim[0]}]
set_load -pin_load 0.0750 [get_ports {dac_refh_to_gpio1_1[1]}]
set_load -pin_load 0.0750 [get_ports {dac_refh_to_gpio1_1[0]}]
set_load -pin_load 0.0750 [get_ports {dac_refl_to_gpio1_0[1]}]
set_load -pin_load 0.0750 [get_ports {dac_refl_to_gpio1_0[0]}]
set_load -pin_load 0.0750 [get_ports {ibias_snk_ena[3]}]
set_load -pin_load 0.0750 [get_ports {ibias_snk_ena[2]}]
set_load -pin_load 0.0750 [get_ports {ibias_snk_ena[1]}]
set_load -pin_load 0.0750 [get_ports {ibias_snk_ena[0]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[23]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[22]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[21]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[20]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[19]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[18]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[17]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[16]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[15]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[14]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[13]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[12]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[11]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[10]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[9]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[8]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[7]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[6]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[5]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[4]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[3]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[2]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[1]}]
set_load -pin_load 0.0750 [get_ports {ibias_src_ena[0]}]
set_load -pin_load 0.0750 [get_ports {ibias_test_to_gpio1_2[1]}]
set_load -pin_load 0.0750 [get_ports {ibias_test_to_gpio1_2[0]}]
set_load -pin_load 0.0750 [get_ports {idac_to_gpio1_2[1]}]
set_load -pin_load 0.0750 [get_ports {idac_to_gpio1_2[0]}]
set_load -pin_load 0.0750 [get_ports {idac_to_gpio1_3[1]}]
set_load -pin_load 0.0750 [get_ports {idac_to_gpio1_3[0]}]
set_load -pin_load 0.0750 [get_ports {idac_value[11]}]
set_load -pin_load 0.0750 [get_ports {idac_value[10]}]
set_load -pin_load 0.0750 [get_ports {idac_value[9]}]
set_load -pin_load 0.0750 [get_ports {idac_value[8]}]
set_load -pin_load 0.0750 [get_ports {idac_value[7]}]
set_load -pin_load 0.0750 [get_ports {idac_value[6]}]
set_load -pin_load 0.0750 [get_ports {idac_value[5]}]
set_load -pin_load 0.0750 [get_ports {idac_value[4]}]
set_load -pin_load 0.0750 [get_ports {idac_value[3]}]
set_load -pin_load 0.0750 [get_ports {idac_value[2]}]
set_load -pin_load 0.0750 [get_ports {idac_value[1]}]
set_load -pin_load 0.0750 [get_ports {idac_value[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_gpio2_0[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_gpio2_0[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_gpio5_3[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_n_to_gpio5_3[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_gpio2_1[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_gpio2_1[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_gpio5_2[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_p_to_gpio5_2[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_adc0[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_adc0[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_amuxbusB[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_amuxbusB[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_analog1[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_analog1[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_comp_p[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_comp_p[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio3_1[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio3_1[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio3_5[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio3_5[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio4_1[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio4_1[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio4_5[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_gpio4_5[0]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_ulpcomp_p[1]}]
set_load -pin_load 0.0750 [get_ports {left_hgbw_opamp_to_ulpcomp_p[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G1[4]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G1[3]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G1[2]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G1[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G1[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G2[4]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G2[3]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G2[2]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G2[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_G2[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_gpio5_7[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_n_to_gpio5_7[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_gpio5_6[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_p_to_gpio5_6[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_adc0[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_adc0[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_amuxbusB[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_amuxbusB[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_analog1[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_analog1[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_comp_p[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_comp_p[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_gpio4_4[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_gpio4_4[0]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_ulpcomp_p[1]}]
set_load -pin_load 0.0750 [get_ports {left_instramp_to_ulpcomp_p[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_gpio5_5[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_n_to_gpio5_5[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_gpio5_4[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_p_to_gpio5_4[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_adc1[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_adc1[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_amuxbusA[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_amuxbusA[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_analog0[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_analog0[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_comp_n[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_comp_n[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_gpio3_4[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_gpio3_4[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_gpio4_0[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_gpio4_0[0]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_ulpcomp_n[1]}]
set_load -pin_load 0.0750 [get_ports {left_lp_opamp_to_ulpcomp_n[0]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[7]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[6]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[5]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[4]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[3]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[2]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[1]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat1_b[0]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[7]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[6]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[5]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[4]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[3]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[2]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[1]}]
set_load -pin_load 0.0750 [get_ports {left_rheostat2_b[0]}]
set_load -pin_load 0.0750 [get_ports {overvoltage_trim[3]}]
set_load -pin_load 0.0750 [get_ports {overvoltage_trim[2]}]
set_load -pin_load 0.0750 [get_ports {overvoltage_trim[1]}]
set_load -pin_load 0.0750 [get_ports {overvoltage_trim[0]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[11]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[10]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[9]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[8]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[7]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[6]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[5]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[4]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[3]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[2]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[1]}]
set_load -pin_load 0.0750 [get_ports {rdac0_value[0]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[11]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[10]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[9]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[8]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[7]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[6]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[5]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[4]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[3]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[2]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[1]}]
set_load -pin_load 0.0750 [get_ports {rdac1_value[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_gpio2_2[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_gpio2_2[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_gpio5_1[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_n_to_gpio5_1[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_gpio2_3[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_gpio2_3[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_gpio5_0[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_p_to_gpio5_0[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_adc1[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_adc1[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_amuxbusA[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_amuxbusA[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_analog0[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_analog0[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_comp_n[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_comp_n[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio3_2[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio3_2[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio3_6[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio3_6[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio4_2[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio4_2[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio4_6[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_gpio4_6[0]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_ulpcomp_n[1]}]
set_load -pin_load 0.0750 [get_ports {right_hgbw_opamp_to_ulpcomp_n[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G1[4]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G1[3]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G1[2]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G1[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G1[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G2[4]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G2[3]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G2[2]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G2[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_G2[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_gpio2_6[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_n_to_gpio2_6[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_gpio2_7[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_p_to_gpio2_7[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_adc1[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_adc1[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_amuxbusA[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_amuxbusA[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_analog0[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_analog0[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_comp_n[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_comp_n[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_gpio3_0[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_gpio3_0[0]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_ulpcomp_n[1]}]
set_load -pin_load 0.0750 [get_ports {right_instramp_to_ulpcomp_n[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_gpio2_4[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_n_to_gpio2_4[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_gpio2_5[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_p_to_gpio2_5[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_adc0[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_adc0[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_amuxbusB[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_amuxbusB[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_analog1[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_analog1[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_comp_p[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_comp_p[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio3_3[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio3_3[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio3_7[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio3_7[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio4_3[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio4_3[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio4_7[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_gpio4_7[0]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_ulpcomp_p[1]}]
set_load -pin_load 0.0750 [get_ports {right_lp_opamp_to_ulpcomp_p[0]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[7]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[6]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[5]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[4]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[3]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[2]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[1]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat1_b[0]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[7]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[6]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[5]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[4]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[3]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[2]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[1]}]
set_load -pin_load 0.0750 [get_ports {right_rheostat2_b[0]}]
set_load -pin_load 0.0750 [get_ports {sio0_connect[1]}]
set_load -pin_load 0.0750 [get_ports {sio0_connect[0]}]
set_load -pin_load 0.0750 [get_ports {sio1_connect[1]}]
set_load -pin_load 0.0750 [get_ports {sio1_connect[0]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_gpio1_6[1]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_gpio1_6[0]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_gpio6_1[1]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_n_to_gpio6_1[0]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_gpio1_7[1]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_gpio1_7[0]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_gpio6_0[1]}]
set_load -pin_load 0.0750 [get_ports {ulpcomp_p_to_gpio6_0[0]}]
set_load -pin_load 0.0750 [get_ports {user_to_adc0[1]}]
set_load -pin_load 0.0750 [get_ports {user_to_adc0[0]}]
set_load -pin_load 0.0750 [get_ports {user_to_adc1[1]}]
set_load -pin_load 0.0750 [get_ports {user_to_adc1[0]}]
set_load -pin_load 0.0750 [get_ports {user_to_comp_n[1]}]
set_load -pin_load 0.0750 [get_ports {user_to_comp_n[0]}]
set_load -pin_load 0.0750 [get_ports {user_to_comp_p[1]}]
set_load -pin_load 0.0750 [get_ports {user_to_comp_p[0]}]
set_load -pin_load 0.0750 [get_ports {user_to_ulpcomp_n[1]}]
set_load -pin_load 0.0750 [get_ports {user_to_ulpcomp_n[0]}]
set_load -pin_load 0.0750 [get_ports {user_to_ulpcomp_p[1]}]
set_load -pin_load 0.0750 [get_ports {user_to_ulpcomp_p[0]}]
set_load -pin_load 0.0750 [get_ports {vbg_test_to_gpio1_1[1]}]
set_load -pin_load 0.0750 [get_ports {vbg_test_to_gpio1_1[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {PCLK}]
set_input_transition 0.5000 [get_ports {PCLK}]
set_input_transition 0.5000 [get_ports {PENABLE}]
set_input_transition 0.5000 [get_ports {PRESETn}]
set_input_transition 0.5000 [get_ports {PSEL}]
set_input_transition 0.5000 [get_ports {PWRITE}]
set_input_transition 0.5000 [get_ports {brownout_filt}]
set_input_transition 0.5000 [get_ports {brownout_timeout}]
set_input_transition 0.5000 [get_ports {brownout_unfilt}]
set_input_transition 0.5000 [get_ports {brownout_vunder}]
set_input_transition 0.5000 [get_ports {comp_out}]
set_input_transition 0.5000 [get_ports {overvoltage_out}]
set_input_transition 0.5000 [get_ports {ulpcomp_out}]
set_input_transition 0.5000 [get_ports {vccd1_pwr_good}]
set_input_transition 0.5000 [get_ports {vccd2_pwr_good}]
set_input_transition 0.5000 [get_ports {vdda1_pwr_good}]
set_input_transition 0.5000 [get_ports {vdda2_pwr_good}]
set_input_transition 0.5000 [get_ports {PADDR[31]}]
set_input_transition 0.5000 [get_ports {PADDR[30]}]
set_input_transition 0.5000 [get_ports {PADDR[29]}]
set_input_transition 0.5000 [get_ports {PADDR[28]}]
set_input_transition 0.5000 [get_ports {PADDR[27]}]
set_input_transition 0.5000 [get_ports {PADDR[26]}]
set_input_transition 0.5000 [get_ports {PADDR[25]}]
set_input_transition 0.5000 [get_ports {PADDR[24]}]
set_input_transition 0.5000 [get_ports {PADDR[23]}]
set_input_transition 0.5000 [get_ports {PADDR[22]}]
set_input_transition 0.5000 [get_ports {PADDR[21]}]
set_input_transition 0.5000 [get_ports {PADDR[20]}]
set_input_transition 0.5000 [get_ports {PADDR[19]}]
set_input_transition 0.5000 [get_ports {PADDR[18]}]
set_input_transition 0.5000 [get_ports {PADDR[17]}]
set_input_transition 0.5000 [get_ports {PADDR[16]}]
set_input_transition 0.5000 [get_ports {PADDR[15]}]
set_input_transition 0.5000 [get_ports {PADDR[14]}]
set_input_transition 0.5000 [get_ports {PADDR[13]}]
set_input_transition 0.5000 [get_ports {PADDR[12]}]
set_input_transition 0.5000 [get_ports {PADDR[11]}]
set_input_transition 0.5000 [get_ports {PADDR[10]}]
set_input_transition 0.5000 [get_ports {PADDR[9]}]
set_input_transition 0.5000 [get_ports {PADDR[8]}]
set_input_transition 0.5000 [get_ports {PADDR[7]}]
set_input_transition 0.5000 [get_ports {PADDR[6]}]
set_input_transition 0.5000 [get_ports {PADDR[5]}]
set_input_transition 0.5000 [get_ports {PADDR[4]}]
set_input_transition 0.5000 [get_ports {PADDR[3]}]
set_input_transition 0.5000 [get_ports {PADDR[2]}]
set_input_transition 0.5000 [get_ports {PADDR[1]}]
set_input_transition 0.5000 [get_ports {PADDR[0]}]
set_input_transition 0.5000 [get_ports {PWDATA[31]}]
set_input_transition 0.5000 [get_ports {PWDATA[30]}]
set_input_transition 0.5000 [get_ports {PWDATA[29]}]
set_input_transition 0.5000 [get_ports {PWDATA[28]}]
set_input_transition 0.5000 [get_ports {PWDATA[27]}]
set_input_transition 0.5000 [get_ports {PWDATA[26]}]
set_input_transition 0.5000 [get_ports {PWDATA[25]}]
set_input_transition 0.5000 [get_ports {PWDATA[24]}]
set_input_transition 0.5000 [get_ports {PWDATA[23]}]
set_input_transition 0.5000 [get_ports {PWDATA[22]}]
set_input_transition 0.5000 [get_ports {PWDATA[21]}]
set_input_transition 0.5000 [get_ports {PWDATA[20]}]
set_input_transition 0.5000 [get_ports {PWDATA[19]}]
set_input_transition 0.5000 [get_ports {PWDATA[18]}]
set_input_transition 0.5000 [get_ports {PWDATA[17]}]
set_input_transition 0.5000 [get_ports {PWDATA[16]}]
set_input_transition 0.5000 [get_ports {PWDATA[15]}]
set_input_transition 0.5000 [get_ports {PWDATA[14]}]
set_input_transition 0.5000 [get_ports {PWDATA[13]}]
set_input_transition 0.5000 [get_ports {PWDATA[12]}]
set_input_transition 0.5000 [get_ports {PWDATA[11]}]
set_input_transition 0.5000 [get_ports {PWDATA[10]}]
set_input_transition 0.5000 [get_ports {PWDATA[9]}]
set_input_transition 0.5000 [get_ports {PWDATA[8]}]
set_input_transition 0.5000 [get_ports {PWDATA[7]}]
set_input_transition 0.5000 [get_ports {PWDATA[6]}]
set_input_transition 0.5000 [get_ports {PWDATA[5]}]
set_input_transition 0.5000 [get_ports {PWDATA[4]}]
set_input_transition 0.5000 [get_ports {PWDATA[3]}]
set_input_transition 0.5000 [get_ports {PWDATA[2]}]
set_input_transition 0.5000 [get_ports {PWDATA[1]}]
set_input_transition 0.5000 [get_ports {PWDATA[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
