###############################################################################
# Created by write_sdc
###############################################################################
current_design gpio_logic_high
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {gpio_logic1}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {gpio_logic1}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
