###############################################################################
# Created by write_sdc
###############################################################################
current_design mgmt_protect
###############################################################################
# Timing Constraints
###############################################################################
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {mprj_HREADYOUT_core}]
set_load -pin_load 0.1900 [get_ports {mprj_HREADY_user}]
set_load -pin_load 0.1900 [get_ports {mprj_HSEL_user}]
set_load -pin_load 0.1900 [get_ports {mprj_HWRITE_user}]
set_load -pin_load 0.1900 [get_ports {user_HCLK}]
set_load -pin_load 0.1900 [get_ports {user_HRESETn}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[31]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[30]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[29]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[28]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[27]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[26]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[25]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[24]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[23]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[22]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[21]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[20]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[19]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[18]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[17]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[16]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[15]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[14]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[13]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[12]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[11]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[10]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[9]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[8]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[7]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[6]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[5]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[4]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[3]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[2]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[1]}]
set_load -pin_load 0.1900 [get_ports {mprj_HADDR_user[0]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[31]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[30]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[29]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[28]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[27]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[26]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[25]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[24]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[23]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[22]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[21]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[20]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[19]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[18]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[17]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[16]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[15]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[14]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[13]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[12]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[11]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[10]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[9]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[8]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[7]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[6]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[5]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[4]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[3]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[2]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[1]}]
set_load -pin_load 0.1900 [get_ports {mprj_HRDATA_core[0]}]
set_load -pin_load 0.1900 [get_ports {mprj_HSIZE_user[2]}]
set_load -pin_load 0.1900 [get_ports {mprj_HSIZE_user[1]}]
set_load -pin_load 0.1900 [get_ports {mprj_HSIZE_user[0]}]
set_load -pin_load 0.1900 [get_ports {mprj_HTRANS_user[1]}]
set_load -pin_load 0.1900 [get_ports {mprj_HTRANS_user[0]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[31]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[30]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[29]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[28]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[27]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[26]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[25]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[24]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[23]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[22]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[21]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[20]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[19]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[18]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[17]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[16]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[15]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[14]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[13]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[12]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[11]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[10]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[9]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[8]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[7]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[6]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[5]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[4]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[3]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[2]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[1]}]
set_load -pin_load 0.1900 [get_ports {mprj_HWDATA_user[0]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[15]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[14]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[13]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[12]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[11]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[10]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[9]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[8]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[7]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[6]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[5]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[4]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[3]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[2]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[1]}]
set_load -pin_load 0.1900 [get_ports {user_irq_core[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frigate_HCLK}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {frigate_HRESETn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_AHB_Ena}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HREADYOUT_user}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HREADY_core}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HSEL_core}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWRITE_core}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HADDR_core[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HRDATA_user[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HSIZE_core[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HSIZE_core[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HSIZE_core[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HTRANS_core[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HTRANS_core[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {mprj_HWDATA_core[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__clkbuf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {user_irq_ena[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.5000 [current_design]
